#### RebarShapeConstraintChordLength Members

---

|  |
| --- |
| RebarShapeConstraintChordLength Class   Constructors   Methods   Properties   See Also |

The  RebarShapeConstraintChordLength  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | RebarShapeConstraintChordLength | Create a constraint to drive chord length. |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Dispose | (Inherited from  RebarShapeConstraint  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetParamId | Return the Id of the parameter associated with this constraint. (Inherited from  RebarShapeConstraint  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  RebarShapeConstraint  .) |

# See Also

RebarShapeConstraintChordLength Class

Autodesk.Revit.DB.Structure Namespace